cf_billing/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.энргКонтрагенты</xr:Item>
				<xr:Item>Catalog.энргЗоныОтвественности</xr:Item>
				<xr:Item>Catalog.энргФилиалы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменениеРеквизитовБанка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не указан владелец банковского счета!'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Организации") Тогда
		
		ИспользуетсяНесколькоОрганизаций 	 = Ложь;
		
		Элементы.Владелец.Видимость          = ИспользуетсяНесколькоОрганизаций;
		Элементы.ЗаголовокВладелец.Видимость = ИспользуетсяНесколькоОрганизаций;
		
		Элементы.ЗаголовокВладелец.Заголовок = НСтр("ru = 'Организация:'");  		
	//  {  vikton	
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.энргКонтрагенты") Тогда
		
		Элементы.ЗаголовокВладелец.Заголовок = НСтр("ru = 'Контрагент:'");	
	//  vikton  }	
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.энргЗоныОтвественности") Тогда
		
		Элементы.ЗаголовокВладелец.Заголовок = НСтр("ru = 'Район:'");
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.энргФилиалы") Тогда
		
		Элементы.ЗаголовокВладелец.Заголовок = НСтр("ru = 'Абонентский отдел:'");
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Неверно указан владелец банковского счета!'"),,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	ОбработатьВыборБанка(ЭтотОбъект, Ложь);
	ОбработатьВыборБанкаДляРасчетов(ЭтотОбъект, Ложь);
	
	ИспользуетсяБанкДляРасчетов = ЗначениеЗаполнено(Объект.БанкДляРасчетов);
	
	БанкНеВыбран            = НСтр("ru = '<заполняется автоматически после ввода БИК>'");
	БанкДляРасчетовНеВыбран = НСтр("ru = '<заполняется автоматически после ввода БИК>'");
	 	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.Наименование = "";
			УстановитьНаименованиеСчета(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
	РазделениеВключено = Ложь
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	МассивНепроверяемыхРеквизитов  = Новый Массив;
	
	Если ИспользуетсяБанкДляРасчетов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("БИКБанка");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("БИКБанкаДляРасчетов");
	КонецЕсли;
			
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ИспользуетсяБанкДляРасчетов Тогда
		ТекущийОбъект.БанкДляРасчетов = Неопределено;
		РеквизитыБанкаДляРасчетов     = Неопределено;
		БИКБанкаДляРасчетов           = "";
		БанкДляРасчетов               = "";
	ИначеЕсли ПустаяСтрока(БИКБанка) Тогда
		РеквизитыБанка     = Неопределено;
		ТекущийОбъект.Банк = Неопределено;
		Банк               = "";
		Элементы.СтраницыБанк.ТекущаяСтраница = Элементы.СтраницаБанкНеВыбран;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура("Ссылка, Владелец", Объект.Ссылка, Объект.Владелец);
	
	Оповестить("ИзмененБанковскийСчет", ПараметрОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(НаименованиеПлательщикаПриПеречисленииВБюджет) = Тип("Строка")
		И ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Организации")
		И (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеНастроекБухгалтерии")) Тогда
			ТекущеНаименованиеПлательщика = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Объект.Владелец, "НаименованиеПлательщикаПриПеречисленииВБюджет"));
			Если НаименованиеПлательщикаПриПеречисленииВБюджет <> ТекущеНаименованиеПлательщика Тогда
				ОрганизацияОбъект = Объект.Владелец.ПолучитьОбъект();
				ОрганизацияОбъект.НаименованиеПлательщикаПриПеречисленииВБюджет = НаименованиеПлательщикаПриПеречисленииВБюджет;
				
				Попытка
					ОрганизацияОбъект.Записать();
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					Если ИнформацияОбОшибке.Причина = Неопределено Тогда
						ОписаниеОшибки = ИнформацияОбОшибке.Описание;
					Иначе
						ОписаниеОшибки = ИнформацияОбОшибке.Причина.Описание;
					КонецЕсли;
					
					ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при записи настроек организации:
						|%1'"), ОписаниеОшибки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				КонецПопытки;
			КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанЭлементБанк" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Банки")
			И ЗначениеЗаполнено(Параметр)
			И Объект.Банк <> Параметр Тогда
			
			Объект.Банк = Параметр;
			
		КонецЕсли;
		
		ОбработатьВыборБанка(ЭтотОбъект, Ложь);
		ОбработатьВыборБанкаДляРасчетов(ЭтотОбъект, Ложь);
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	Объект.НомерСчета = СокрЛП(Объект.НомерСчета);
	
	УстановитьНаименованиеСчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораБанка();
	
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокНайденныхБанков = НайтиБанкВКлассификаторе(СокрЛП(Текст), Элемент.Имя, ложь);
	Если СписокНайденныхБанков <> Неопределено Тогда
		Если СписокНайденныхБанков.Количество() > 1 Тогда
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора         = СписокНайденныхБанков;
		ИначеЕсли СписокНайденныхБанков.Количество() = 1 Тогда
			Объект.Банк          = СписокНайденныхБанков[0].Значение;
			ОбработатьВыборБанка(ЭтотОбъект);
		Иначе
			ПредложитьСтандартныйВыбор(СокрЛП(Текст), Элемент.Имя, ложь);
		КонецЕсли;
	КонецЕсли;
	
	ТекущийЭлемент = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Банк = ВыбранноеЗначение;
	ОбработатьВыборБанка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РеквизитыБанка       = Неопределено;
	Объект.Банк          = Неопределено;
	ОбработатьВыборБанка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Банк) Тогда
		ОткрытьФорму("Справочник.КлассификаторБанков.ФормаОбъекта", Новый Структура("Ключ", Объект.Банк), ЭтотОбъект);
	Иначе
		ОткрытьФормуВыбораБанка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяБанкДляРасчетовПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаДляРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораБанкаДляРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаДляРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокНайденныхБанков = НайтиБанкВКлассификаторе(СокрЛП(Текст), Элемент.Имя, ложь);
	Если СписокНайденныхБанков <> Неопределено Тогда
		
		Если СписокНайденныхБанков.Количество() > 1 Тогда
			СтандартнаяОбработка   = Ложь;
			ДанныеВыбора           = СписокНайденныхБанков;
		ИначеЕсли СписокНайденныхБанков.Количество() = 1 Тогда
			Объект.БанкДляРасчетов = СписокНайденныхБанков[0].Значение;
			ОбработатьВыборБанкаДляРасчетов(ЭтотОбъект);
		Иначе
			ПредложитьСтандартныйВыбор(СокрЛП(Текст), Элемент.Имя, ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийЭлемент = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаДляРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка   = Ложь;
	Объект.БанкДляРасчетов = ВыбранноеЗначение;
	ОбработатьВыборБанкаДляРасчетов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БИКБанкаДляРасчетовОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка      = Ложь;
	РеквизитыБанкаДляРасчетов = Неопределено;
	Объект.БанкДляРасчетов    = Неопределено;
	ОбработатьВыборБанкаДляРасчетов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкДляРасчетовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.БанкДляРасчетов) Тогда
		ОткрытьФорму("Справочник.КлассификаторБанков.ФормаОбъекта", Новый Структура("Ключ", Объект.БанкДляРасчетов), ЭтотОбъект);
	Иначе
		ОткрытьФормуВыбораБанкаДляРасчетов();
	КонецЕсли;
	
КонецПроцедуры
//****/
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	СформироватьАвтоНаименование(ЭтотОбъект, Объект.Наименование);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВсеБанки(Команда)
	
	ОткрытьФормуВыбораБанка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеБанкиДляРасчетов(Команда)
	
	ОткрытьФормуВыбораБанкаДляРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиБанк()
	
	ТекущийЭлемент = Элементы.БИКБанка;
	СписокНайденныхБанков = НайтиБанкВКлассификаторе(СокрЛП(БИКБанка), "БИКБанка", ложь);
	
	Если СписокНайденныхБанков <> Неопределено И СписокНайденныхБанков.Количество() = 0 Тогда
		ПредложитьСтандартныйВыбор(СокрЛП(БИКБанка), "БИКБанка", ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиБанкДляРасчетов()
	
	ТекущийЭлемент = Элементы.БИКБанкаДляРасчетов;
	СписокНайденныхБанков = НайтиБанкВКлассификаторе(СокрЛП(БИКБанкаДляРасчетов), "БИКБанкаДляРасчетов", ложь);
	
	Если СписокНайденныхБанков <> Неопределено И СписокНайденныхБанков.Количество() = 0 Тогда
		ПредложитьСтандартныйВыбор(СокрЛП(БИКБанкаДляРасчетов), "БИКБанкаДляРасчетов", ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПлатежныхПорученийТребований(Команда)
	
	ПараметрыФормы = Новый Структура("БанковскийСчетОрганизации, БанковскийСчетКонтрагента, АвтоТекстНазначения, НастройкиПП");
	
	Если Элементы.ГруппаПодразделение.Видимость Тогда
		// Владелец - Организация
		ПараметрыФормы.Вставить("ЭтоСчетОрганизации", Истина);
		ПараметрыФормы.Вставить("Организация",        Объект.Владелец);
		ПараметрыФормы.БанковскийСчетОрганизации = Объект.Ссылка;
		ПараметрыФормы.НастройкиПП = Новый Структура("ТекстКорреспондента, ВсегдаУказыватьКПП, МесяцПрописью, СуммаБезКопеек",
			Объект.ТекстКорреспондента, Объект.ВсегдаУказыватьКПП, Объект.МесяцПрописью, Объект.СуммаБезКопеек);
		
		Если ТипЗнч(НаименованиеПлательщикаПриПеречисленииВБюджет) = Тип("Строка") Тогда
			ПараметрыФормы.НастройкиПП.Вставить("НаименованиеПлательщикаПриПеречисленииВБюджет",
				НаименованиеПлательщикаПриПеречисленииВБюджет);
		КонецЕсли;
	Иначе
		// Владелец - Контрагент
		ПараметрыФормы.БанковскийСчетКонтрагента = Объект.Ссылка;
		ПараметрыФормы.Вставить("Контрагент", Объект.Владелец);
		ПараметрыФормы.НастройкиПП = Новый Структура("ТекстКорреспондента, ТекстНазначения, ВсегдаУказыватьКПП",
			Объект.ТекстКорреспондента, Объект.ТекстНазначения, Объект.ВсегдаУказыватьКПП);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Наименование", Объект.Наименование);
	ОткрытьФорму("ОбщаяФорма.НастройкиПлатежныхПорученийТребований", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		
		Если ВыбранноеЗначение.Свойство("МесяцПрописью") Тогда
			ХранилищеОбщихНастроек.Сохранить("НастройкиПлатежныхПорученийТребований", "ВсегдаУказыватьКППОрганизации",
				ВыбранноеЗначение.ВсегдаУказыватьКПП);
			НаименованиеПлательщикаПриПеречисленииВБюджет = СокрЛП(ВыбранноеЗначение.НаименованиеПлательщикаПриПеречисленииВБюджет);
		Иначе
			Если ВыбранноеЗначение.Свойство("ВсегдаУказыватьКПП") Тогда
				ХранилищеОбщихНастроек.Сохранить("НастройкиПлатежныхПорученийТребований", "ВсегдаУказыватьКППКонтрагента",
					ВыбранноеЗначение.ВсегдаУказыватьКПП);
			КонецЕсли;
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры
//***///
&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьВыборБанка(Форма, ВызватьУправлениеФормой = Истина)
	
	Форма.РеквизитыБанка = ПолучитьРеквизитыБанка(Форма.Объект.Банк, Форма.Объект.Владелец);
	Форма.БИКБанка       = Форма.РеквизитыБанка.Код;
	Форма.ДеятельностьБанкаПрекращена     = Форма.РеквизитыБанка.ДеятельностьБанкаПрекращена;
	Форма.СоглашениеПрямогоОбменаСБанками = Форма.РеквизитыБанка.СоглашениеПрямогоОбменаСБанками;
	Форма.Городбанка=форма.реквизитыбанка.город;
	Форма.КоррСчетБанка=Форма.реквизитыбанка.КоррСчет;
	форма.банк=форма.реквизитыбанка.наименование;
	
	
	Если ЗначениеЗаполнено(Форма.СоглашениеПрямогоОбменаСБанками) Тогда
		Форма.СообщениеПрямогоОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Соглашение о прямом обмене %1'"), НРЕГ(Форма.РеквизитыБанка.СтатусСоглашения));
	Иначе
		Форма.СообщениеПрямогоОбмена = НСтр("ru = ''");
	КонецЕсли;
	
	Если ВызватьУправлениеФормой Тогда
		УправлениеФормой(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьВыборБанкаДляРасчетов(Форма, ВызватьУправлениеФормой = Истина)
	
	Форма.РеквизитыБанкаДляРасчетов = ПолучитьРеквизитыБанка(Форма.Объект.БанкДляРасчетов, Форма.Объект.Владелец);
	Форма.БИКБанкаДляРасчетов       = Форма.РеквизитыБанкаДляРасчетов.Код;
	Форма.ДеятельностьБанкаНепрямыхРасчетовПрекращена = Форма.РеквизитыБанкаДляРасчетов.ДеятельностьБанкаПрекращена;
	
	Если ВызватьУправлениеФормой Тогда
		УправлениеФормой(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	УстановитьНаименованиеСчета(Форма);
	
	Если ЗначениеЗаполнено(Объект.Банк) И
		ЗначениеЗаполнено(Форма.СоглашениеПрямогоОбменаСБанками) Тогда
		Форма.Банк = Форма.РеквизитыБанка.Наименование + " " + Форма.РеквизитыБанка.Город;
		  
		Элементы.СтраницыБанк.ТекущаяСтраница = Элементы.СтраницаБанкССоглашением;
	ИначеЕсли ЗначениеЗаполнено(Объект.Банк) Тогда
		Форма.Банк = Форма.РеквизитыБанка.Наименование + " " + Форма.РеквизитыБанка.Город;
		Элементы.СтраницыБанк.ТекущаяСтраница = Элементы.СтраницаБанк;
	Иначе
		Форма.Банк = "";
		Элементы.СтраницыБанк.ТекущаяСтраница = Элементы.СтраницаБанкНеВыбран;
	КонецЕсли;     
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыБанка(Знач Банк, Знач ВладелецСчета)
	
	СтрокаРеквизитов    = Новый Структура("Код, КоррСчет, Наименование, Город");
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк,
		СтрокаРеквизитов);
	СтруктураРеквизитов.Вставить("ДеятельностьБанкаПрекращена", ДеятельностьБанкаПрекращена(СтруктураРеквизитов.Код));
	
	СтруктураРеквизитов.Вставить("СоглашениеПрямогоОбменаСБанками", Неопределено);
	СтруктураРеквизитов.Вставить("СтатусСоглашения", Неопределено);
		
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНаименованиеСчета(Форма, ИзменениеНомераСчета = Ложь)
	
	Объект = Форма.Объект;
	
	Если ПустаяСтрока(Объект.Наименование) ИЛИ Объект.Наименование = Форма.АвтоНаименование Тогда
		Форма.АвтоНаименование  = СформироватьАвтоНаименование(Форма);
		Если НЕ ПустаяСтрока(Форма.АвтоНаименование) И Форма.АвтоНаименование <> Объект.Наименование Тогда
			Объект.Наименование = Форма.АвтоНаименование;
		КонецЕсли;
	Иначе
		Если ИзменениеНомераСчета И НЕ ПустаяСтрока(Форма.НомерСчетаТекущий) Тогда
			Объект.Наименование = СтрЗаменить(Объект.Наименование, Форма.НомерСчетаТекущий, СокрЛП(Объект.НомерСчета));
		КонецЕсли;
		
		Форма.АвтоНаименование = СформироватьАвтоНаименование(Форма, Объект.Наименование);
	КонецЕсли;
	
	Форма.НомерСчетаТекущий = СокрЛП(Объект.НомерСчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьАвтоНаименование(Форма, Знач Текст = "")
	
	Элементы     = Форма.Элементы;
	Объект       = Форма.Объект;
	БанкЗаполнен = ЗначениеЗаполнено(Объект.Банк);
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	НомерСчетаТекущий   = СокрЛП(Объект.НомерСчета);
	СтрокаНаименования1 = Лев(
		НомерСчетаТекущий
		+ ?(БанкЗаполнен, " в " + Объект.Банк, ""),
		100);
	
	Если НЕ ПустаяСтрока(СтрокаНаименования1) Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СокрЛП(СтрокаНаименования1));
	КонецЕсли;
	
	ТекстНомерСчетаВалюта = НомерСчетаТекущий;
	СтрокаНаименования2   = Лев(
		?(БанкЗаполнен, "" + Объект.Банк, "")
		+ ?(ПустаяСтрока(ТекстНомерСчетаВалюта), "", " (" + ТекстНомерСчетаВалюта + ")"),
		100);
	
	Строки1и2НеРавны = СокрЛП(СтрокаНаименования2) <> "(" + СтрокаНаименования1 + ")";
	Если СтрокаНаименования2 <> "" И Строки1и2НеРавны
			И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(СтрокаНаименования2) = Неопределено Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СокрЛП(СтрокаНаименования2));
	КонецЕсли;
	
	СтрокаНаименования = Лев(
		НомерСчетаТекущий
		+ ?(БанкЗаполнен, ", " + Объект.Банк, ""),
		100);
	
	Если НЕ ПустаяСтрока(СтрокаНаименования) И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(СтрокаНаименования) = Неопределено Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СокрЛП(СтрокаНаименования));
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Текст) И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(Текст) = Неопределено Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СокрЛП(Текст));
	КонецЕсли;
	
	Возврат СтрокаНаименования;
	
КонецФункции

&НаКлиенте
Функция НайтиБанкВКлассификаторе(ТекстДляПоиска, Поле, Валютный)
	
	Если ПустаяСтрока(ТекстДляПоиска) Тогда
		ТекстСообщения = "";
		Если Поле = "БИКБанкаДляРасчетов" Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Заполнение", "БИК банка для расчетов");
			КонецЕсли;
		Иначе
			Если НЕ ИспользуетсяБанкДляРасчетов Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Заполнение", "БИК");
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле);
		КонецЕсли;
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если Найти(Поле, "БИК") = 1 Тогда
		ОбластьПоиска = "Код";
	ИначеЕсли Найти(Поле, "Коррсчет") = 1 Тогда
		ОбластьПоиска = "КоррСчет";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СписокНайденныхБанков = ПолучитьСписокБанковПоРеквизитам(ОбластьПоиска, ТекстДляПоиска);
	
	Если ОбластьПоиска = "Код" И СписокНайденныхБанков.Количество() = 1 Тогда
		Если Поле = "БИКБанкаДляРасчетов" Тогда
			ДеятельностьБанкаНепрямыхРасчетовПрекращена = ДеятельностьБанкаПрекращена(ТекстДляПоиска);
		Иначе
			ДеятельностьБанкаПрекращена = ДеятельностьБанкаПрекращена(ТекстДляПоиска);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокНайденныхБанков;
	
КонецФункции

&НаКлиенте
Процедура ПредложитьСтандартныйВыбор(ТекстДляПоиска, Поле, Валютный)
	Перем ТекстОшибки;
	
	Если Найти(Поле, "БИК") = 1 Тогда
		ОбластьПоиска = "Код";
	ИначеЕсли Найти(Поле, "Коррсчет") = 1 Тогда
		ОбластьПоиска = "КоррСчет";
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ОбластьПоиска = "Код" Тогда
		
		Если НЕ ПроверитьКорректностьБИК(ТекстДляПоиска, ТекстОшибки) Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле);
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Банк с БИК ""%1"" не найден в справочнике банков'"), ТекстДляПоиска);
		
	ИначеЕсли ОбластьПоиска = "КоррСчет" Тогда
		
		Если НЕ ПроверитьКорректностьНомераСчета(ТекстДляПоиска, Валютный, ТекстОшибки) Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле);
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Банк с корр. счетом ""%1"" не найден в справочнике банков'"), ТекстДляПоиска);
		
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ВЫБРАТЬ",     НСтр("ru = 'Выбрать из списка'"));
	Если НЕ РазделениеВключено Тогда
		Кнопки.Добавить("Создать", НСтр("ru = 'Создать банк'"));
	КонецЕсли;
	Кнопки.Добавить("Продолжить",  НСтр("ru = 'Продолжить ввод'"));
	Кнопки.Добавить("Отменить",    НСтр("ru = 'Отменить ввод'"));
	
	ДополнительныеПараметры   = Новый Структура("Поле, ТекстДляПоиска", Поле, ТекстДляПоиска);
	ОписаниеОповещениеяВопрос = Новый ОписаниеОповещения("ПредложитьСтандартныйВыборЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(
		ОписаниеОповещениеяВопрос,
		ТекстВопроса,
		Кнопки,,
		"ВЫБРАТЬ",
		НСтр("ru = 'Банк не найден'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьСтандартныйВыборЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = "ВЫБРАТЬ" Тогда
		
		Если ДополнительныеПараметры.Поле = "БИКБанкаДляРасчетов" Тогда
			ОткрытьФормуВыбораБанкаДляРасчетов();
		Иначе
			ОткрытьФормуВыбораБанка();
		КонецЕсли;
		
	ИначеЕсли Ответ = "Создать" Тогда
		
		ПараметрыФормы = Новый Структура("Код, РучноеИзменение", СокрЛП(ДополнительныеПараметры.ТекстДляПоиска), Истина);
		ОткрытьФорму("Справочник.КлассификаторБанков.ФормаОбъекта",
			ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Ответ = "Отменить" Тогда
		Если ЗначениеЗаполнено(Объект.Банк) Тогда
			ЭтотОбъект[ДополнительныеПараметры.Поле] = РеквизитыБанка.Код;
		Иначе
			ЭтотОбъект[ДополнительныеПараметры.Поле] = "";
		КонецЕсли;
		
	Иначе
		ТекущийЭлемент = Элементы[ДополнительныеПараметры.Поле];
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокБанковПоРеквизитам(Знач Поле, Знач Значение) Экспорт
	
	СписокБанков = Новый СписокЗначений;
	
	Если ПустаяСтрока(Значение) Тогда
		
		Возврат СписокБанков;
		
	КонецЕсли;
	
	ТаблицаБанков = Справочники.классификаторбанков.ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение);
	
	СписокБанков.ЗагрузитьЗначения(ТаблицаБанков.ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокБанков;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьКорректностьНомераСчета(Номер, ВалютныйСчет = Ложь, ТекстОшибки = "")
	
	Результат = Истина;
	
	Если ПустаяСтрока(Номер) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если НЕ ВалютныйСчет И СтрДлина(Номер) <> 20 Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ") +
			НСтр("ru = 'Номер счета должен состоять из 20 цифр'");
		Результат   = Ложь;
	ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ") +
			НСтр("ru = 'В номере банковского счета присутствуют не только цифры.
				|Возможно, номер указан неверно'");
		Результат   = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьКорректностьБИК(БИК, ТекстОшибки = "")
	
	Результат = Истина;
	
	Если ПустаяСтрока(БИК) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если СтрДлина(БИК) <> 9 Тогда
		ТекстОшибки = ТекстОшибки +
			НСтр("ru = 'БИК банка должен состоять из 9 цифр'");
		Результат   = Ложь;
	ИначеЕсли НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(БИК) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ") +
			НСтр("ru = 'В составе БИК банка должны быть только цифры'");
		Результат   = Ложь;
	ИначеЕсли НЕ Лев(БИК, 2) = "04" Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ") +
			НСтр("ru = 'Первые 2 цифры БИК банка должны быть ""04""'");
		Результат   = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораБанка()
	
	ПараметрыФормы = Новый Структура(
		"ТекущаяСтрока, ПараметрВыборГруппИЭлементов",
		Объект.Банк, ИспользованиеГруппИЭлементов.Элементы);
		
	ОткрытьФорму("Справочник.КлассификаторБанков.ФормаВыбора", ПараметрыФормы, Элементы.БИКБанка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораБанкаДляРасчетов()
	
	ПараметрыФормы = Новый Структура(
		"ТекущаяСтрока, ПараметрВыборГруппИЭлементов",
		Объект.БанкДляРасчетов, ИспользованиеГруппИЭлементов.Элементы);
	
	ОткрытьФорму("Справочник.КлассификаторБанков.ФормаВыбора", ПараметрыФормы, Элементы.БИКБанкаДляРасчетов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДеятельностьБанкаПрекращена(БИК)
	
	Результат = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификаторБанков.ДеятельностьПрекращена
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код = &БИК";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("БИК", БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДеятельностьПрекращена;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
